---
kind: property
id: P:Autodesk.Revit.DB.Architecture.RailingType.SecondaryHandRailPosition
source: html/f50c8b12-cf61-8570-48ff-923bd320d433.htm
---
# Autodesk.Revit.DB.Architecture.RailingType.SecondaryHandRailPosition Property

The position of the secondary handrail.

## Syntax (C#)
```csharp
public HandRailPosition SecondaryHandRailPosition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The rail has no secondary hand rail.